0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    "side_wall|bottom|defaultFaces"
    {
        type            fixedFluxPressure;
	gradient	uniform 0;
        value           uniform 0;
    }

    top
    {
        type            prghTotalPressure;
        p0              uniform 0;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ***************************caesar_wiratama_2023************************** //
// ************************************************************************* //
