0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            calculated;
        value           uniform 0;
    }

    "side_wall|bottom|defaultFaces"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }
}

// ***************************caesar_wiratama_2023************************** //
// ************************************************************************* //
